import "./js/menuTogle.js";
console.log(
  `Так как заметила по прошлым оценкам, что некоторые студенты могли упустить прочтение рекомендации к проверке заданий, оставляю тут некоторые пункты рекомендаций а также ссылку на источник. Ниже есть пункты самопроверки`
);
console.log(
  `https://github.com/rolling-scopes-school/tasks/blob/master/tasks/portfolio/portfolio-part2.md`
);
console.log(
  `https://github.com/rolling-scopes-school/tasks/blob/master/tasks/portfolio/portfolio.md`
);

console.log(`Особенности проверки вёрстки на соответствие макету:
!!! допускается отклонение вёрстки от макета до 10px по горизонтали и вертикали,
 если соблюдается визуальное сходство вёрстки и макета 
!!! разрешены и даже приветствуются правки размеров и расположения криво нарисованных блоков (относится к например переключателю языков в хедере, так как в макете нарисовано не семетрично, а так же к некоторым отступам)
!!! при проверке вёрстки при помощи расширения PerfectPixel в первую очередь убедетесь, что в расширении выставлен масштаб 1, в браузере и операционной системе - масштаб 100%
!!! каждый блок и секция рассматриваются по раздельности, т.е. недочеты предыдущего блока не переносятся на следующий, а при переходе проверки на следующий блок, мы его выравниваем с наложенным изображением
!!! относительно текста проверяем его выравнивание по левому краю, отступы до границы блока. Размеры текста проверяются только по высоте. Отличие в ширине слов и отступах между буквами при сопоставлении макета и вёрстки не считается ошибкой, если используется правильный шрифт с правильно указанными свойствами`);

console.log(`Самооценка верстки:
Оценка- 82 балла

Все ок, по макету совпадает, прокрутки нет.

Частично выполненные пункты:

1) при нажатии на бургер-иконку справа плавно появляется адаптивное меню, бургер-иконка изменяется на крестик — 3 балл(а)

Комментарий проверяющего: все работает, но не плавно (-1)

2) при нажатии на крестик адаптивное меню плавно скрывается уезжая за правую часть экрана, крестик превращается в бургер-иконку — 3 балл(а)

Комментарий проверяющего: все работает, но не плавно (-1)

3) при клике по ссылке в адаптивном меню адаптивное меню плавно скрывается, крестик превращается в бургер-иконку — 3 балл(а)

Комментарий проверяющего: все работает, но не плавно (-1)`);
